In [0]:
import os
import numpy as np
import pandas as pd

In [125]:
os.getcwd()

'/content'

In [0]:
df_train = pd.read_csv('./train.csv')
df_test = pd.read_csv('./test.csv')

In [154]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [127]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [0]:
target = 'Survived'
columns = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']

In [129]:
df_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [130]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [131]:
df_train[columns]

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         3    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         3  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         3    male  35.0      0      0   8.0500        S
..      ...     ...   ...    ...    ...      ...      ...
886       2    male  27.0      0      0  13.0000        S
887       1  female  19.0      0      0  30.0000        S
888       3  female   NaN      1      2  23.4500        S
889       1    male  26.0      0      0  30.0000        C
890       3    male  32.0      0      0   7.7500        Q

[891 rows x 7 columns]

In [132]:
df_test

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [0]:
X_train = df_train[columns]
X_train = X_train.dropna()
X_test = df_test[columns]
X_test = X_test.dropna()
y_train = df_train.iloc[X_train.index]
y_train = y_train[target]

In [141]:
X_train

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         3    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         3  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         3    male  35.0      0      0   8.0500        S
..      ...     ...   ...    ...    ...      ...      ...
885       3  female  39.0      0      5  29.1250        Q
886       2    male  27.0      0      0  13.0000        S
887       1  female  19.0      0      0  30.0000        S
889       1    male  26.0      0      0  30.0000        C
890       3    male  32.0      0      0   7.7500        Q

[712 rows x 7 columns]

In [142]:
y_train

0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: Survived, Length: 712, dtype: int64

In [32]:
for str in columns:
  print(df_train[str].unique())

[  1   2   3   4   5   7   8   9  10  11  12  13  14  15  16  17  19  21
  22  23  24  25  26  28  31  34  35  36  38  39  40  41  42  44  45  50
  51  52  53  54  55  57  58  59  60  61  63  64  67  68  69  70  71  72
  73  74  75  76  79  80  81  82  84  85  86  87  89  90  91  92  93  94
  95  97  98  99 100 101 103 104 105 106 107 109 111 112 113 114 115 116
 117 118 119 120 121 123 124 125 126 128 130 131 132 133 134 135 136 137
 138 139 140 142 143 144 145 146 147 148 149 150 151 152 153 154 156 157
 158 161 162 163 164 165 166 168 170 171 172 173 174 175 176 178 179 180
 183 184 185 188 189 190 191 192 193 194 195 196 198 200 201 203 204 205
 206 207 208 209 210 211 212 213 214 216 217 218 219 220 221 222 223 225
 226 227 228 229 231 232 233 234 235 237 238 239 240 243 244 245 246 247
 248 249 250 252 253 254 255 256 258 259 260 262 263 264 266 267 268 269
 270 272 273 274 276 277 279 280 281 282 283 284 286 287 288 289 290 291
 292 293 294 295 297 298 300 303 306 308 309 310 311 312 313 314 315 316
 317 318 319 320 321 322 323 324 326 327 328 329 330 332 333 334 337 338
 339 340 341 342 343 344 345 346 347 349 350 351 353 354 356 357 358 361
 362 363 364 366 367 370 371 372 373 374 375 377 378 379 380 381 382 383
 384 386 387 388 390 391 392 393 394 395 396 397 398 399 400 401 402 403
 404 405 406 407 408 409 413 415 417 418 419 420 422 423 424 425 427 428
 430 431 433 434 435 436 437 438 439 440 441 442 443 444 446 447 448 449
 450 451 453 454 456 457 459 461 462 463 464 466 468 470 472 473 474 475
 477 478 479 480 481 483 484 485 487 488 489 490 492 493 494 495 497 499
 500 501 502 504 505 506 507 509 510 511 513 514 515 516 517 519 520 521
 522 524 526 527 529 530 531 533 535 536 537 538 540 541 542 543 544 545
 546 547 549 550 551 552 554 555 556 557 559 560 562 563 566 567 568 570
 571 572 573 575 576 577 578 580 581 582 583 584 586 587 588 589 591 592
 593 595 596 598 600 601 604 605 606 607 608 609 610 611 615 616 617 618
 619 620 621 622 623 624 625 626 627 628 629 631 632 633 635 636 637 638
 639 641 642 643 645 646 647 648 650 652 653 655 656 658 659 660 661 662
 663 664 665 666 667 669 671 672 673 674 676 677 678 679 680 682 683 684
 685 686 687 688 689 690 691 692 694 695 696 697 699 700 701 702 703 704
 705 706 707 708 709 711 713 714 715 716 717 718 720 721 722 723 724 725
 726 727 729 730 731 732 734 735 736 737 738 742 743 744 745 746 747 748
 749 750 751 752 753 754 755 756 757 758 759 760 762 763 764 765 766 768
 770 771 772 773 775 776 778 780 781 782 783 785 786 787 788 789 790 792
 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812
 813 814 815 817 818 819 820 821 822 823 824 825 828 831 832 834 835 836
 837 839 841 842 843 844 845 846 848 849 851 852 853 854 855 856 857 858
 859 861 862 863 865 866 867 868 870 871 872 873 874 875 876 877 878 880
 881 882 883 884 885 886 887 888 890 891]
[3 1 2]
['male' 'female']
[22.   38.   26.   35.   54.    2.   27.   14.    4.   58.   20.   39.
 55.   31.   34.   15.   28.    8.   19.   40.   66.   42.   21.   18.
  3.    7.   49.   29.   65.   28.5   5.   11.   45.   17.   32.   16.
 25.    0.83 30.   33.   23.   24.   46.   59.   71.   37.   47.   14.5
 70.5  32.5  12.    9.   36.5  51.   55.5  40.5  44.    1.   61.   56.
 50.   36.   45.5  20.5  62.   41.   52.   63.   23.5   0.92 43.   60.
 10.   64.   13.   48.    0.75 53.   57.   80.   70.   24.5   6.    0.67
 30.5   0.42 34.5  74.  ]
[1 0 3 4 2 5]
[0 1 2 5 3 4 6]
[  7.25    71.2833   7.925   53.1      8.05    51.8625  21.075   11.1333
  30.0708  16.7     26.55    31.275    7.8542  16.      29.125   18.
  26.      13.       8.0292  35.5     31.3875 263.      27.7208  10.5
  82.1708  52.      11.2417   9.475   21.      41.5792   7.8792  17.8
  39.6875   7.8     76.7292  61.9792   7.2292  27.75    46.9     83.475
  27.9      8.1583   8.6625  73.5     14.4542  56.4958   7.65    29.
  12.475    9.       9.5     47.1     15.85    34.375   61.175   20.575
  34.6542  63.3583  23.       7.8958  77.2875   8.6542   9.825   14.4583
   7.75   247.5208   7.1417   6.975    7.05    14.5     15.0458  26.2833
   9.2167  79.2      6.75    11.5     36.75     7.7958  12.525   66.6
  61.3792   7.7333  16.1     15.75     7.775   20.525   33.5     30.6958
  28.7125   0.      39.      22.025   15.5    146.5208   8.4042   6.4958
   7.225   10.4625  18.7875  31.     113.275   27.      76.2917  90.
   9.35    13.5     26.25    12.275    7.125   52.5542  20.2125  15.2458
  86.5    512.3292  79.65   153.4625 135.6333  19.5     29.7     77.9583
  20.25    78.85    91.0792  12.875    8.85   151.55   108.9     24.
  56.9292  83.1583 262.375   14.     164.8667 134.5     12.35     6.2375
  57.9792  28.5     15.9      9.225   55.      75.25    69.3     55.4417
 211.5      4.0125 227.525   15.7417  12.     120.      12.65    18.75
  32.5     24.15     7.875   14.4     55.9     81.8583  19.2583  30.5
  89.1042  38.5     13.7917   9.8375   7.0458   7.5208  12.2875   9.5875
  49.5042  78.2667  22.525   26.2875  59.4      7.4958  34.0208  93.5
 106.425   49.5     71.     110.8833  39.6     17.4     51.4792  26.3875
  30.      40.125   15.      15.55    65.      32.3208   7.0542   7.55
   8.4333 133.65    25.5875   9.8417  10.1708 211.3375  57.      13.4167
   7.7417   9.4833  33.       8.3625  25.9292   8.6833   8.5167   7.8875
  37.0042   6.45     8.3      6.4375  39.4     14.1083  13.8583  50.4958
   5.       9.8458  10.5167]
['S' 'C' 'Q']

In [0]:
#sex_mapping = {label:idx for idx, label in enumerate(np.unique(X_train['Sex']))}
#embarked_mapping = {label:idx for idx, label in enumerate(np.unique(X_train['Embarked']))}

In [60]:
#sex_mapping

{'female': 0, 'male': 1}

In [61]:
#embarked_mapping

{'C': 0, 'Q': 1, 'S': 2}

In [0]:
#X_train['Sex'] = X_train['Sex'].map(sex_mapping)
#X_train['Embarked'] = X_train['Embarked'].map(embarked_mapping)

In [0]:
X_train = pd.get_dummies(X_train)
X_test = pd.get_dummies(X_test)

In [144]:
X_train.head()

   Pclass   Age  SibSp  Parch  ...  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0       3  22.0      1      0  ...         1           0           0           1
1       1  38.0      1      0  ...         0           1           0           0
2       3  26.0      0      0  ...         0           0           0           1
3       1  35.0      1      0  ...         0           0           0           1
4       3  35.0      0      0  ...         1           0           0           1

[5 rows x 10 columns]

In [145]:
X_test.head()

   Pclass   Age  SibSp  Parch  ...  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0       3  34.5      0      0  ...         1           0           1           0
1       3  47.0      1      0  ...         0           0           0           1
2       2  62.0      0      0  ...         1           0           1           0
3       3  27.0      0      0  ...         1           0           0           1
4       3  22.0      1      1  ...         0           0           0           1

[5 rows x 10 columns]

In [146]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 10 columns):
Pclass        712 non-null int64
Age           712 non-null float64
SibSp         712 non-null int64
Parch         712 non-null int64
Fare          712 non-null float64
Sex_female    712 non-null uint8
Sex_male      712 non-null uint8
Embarked_C    712 non-null uint8
Embarked_Q    712 non-null uint8
Embarked_S    712 non-null uint8
dtypes: float64(2), int64(3), uint8(5)
memory usage: 36.9 KB

In [0]:
from sklearn.preprocessing import StandardScaler

stdsc = StandardScaler()
X_train_std = stdsc.fit_transform(X_train)
X_test_std = stdsc.fit_transform(X_test)

In [148]:
X_train_std

array([[ 0.90859974, -0.52766856,  0.52251079, ..., -0.47261792,
        -0.20232566,  0.53403984],
       [-1.48298257,  0.57709388,  0.52251079, ...,  2.11587407,
        -0.20232566, -1.87251946],
       [ 0.90859974, -0.25147795, -0.55271372, ..., -0.47261792,
        -0.20232566,  0.53403984],
       ...,
       [-1.48298257, -0.73481151, -0.55271372, ..., -0.47261792,
        -0.20232566,  0.53403984],
       [-1.48298257, -0.25147795, -0.55271372, ...,  2.11587407,
        -0.20232566, -1.87251946],
       [ 0.90859974,  0.16280796, -0.55271372, ..., -0.47261792,
         4.94252683, -1.87251946]])

In [149]:
X_test_std

array([[ 1.01542612,  0.30665727, -0.55327231, ..., -0.57386172,
         3.74772658, -1.47739376],
       [ 1.01542612,  1.19423645,  0.59130978, ..., -0.57386172,
        -0.26682843,  0.67686762],
       [-0.16804587,  2.25933148, -0.55327231, ..., -0.57386172,
         3.74772658, -1.47739376],
       ...,
       [ 1.01542612, -0.15488391, -0.55327231, ..., -0.57386172,
        -0.26682843,  0.67686762],
       [-1.35151786,  0.62618578, -0.55327231, ...,  1.74258009,
        -0.26682843, -1.47739376],
       [ 1.01542612,  0.59068261, -0.55327231, ..., -0.57386172,
        -0.26682843,  0.67686762]])

In [166]:
from sklearn.linear_model import LogisticRegression

lr = LogisticRegression(C=100.0, random_state=1)
lr.fit(X_train_std, y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=100.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=1, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [0]:
pred = lr.predict(X_test_std)

In [160]:
len(pred)

331

In [167]:
lr.score(X_train_std, y_train)

0.800561797752809